export const warningValidationMessages = {
    extra_children_price: [
        'Зверніть увагу: при наявності додаткових гостей (дітей) вартість їх проживання дорівнює 0!',
    ],
    extra_children: [
        'Якщо "Кількість додаткових гостей (дорослих)" дорівнює 0 - не треба зазначати кількість додаткових гостей (дітей)!',
    ],
    rental_price: ['При наявності основних гостей вартість їх проживання дорівнює 0!'],
    extra_adult_price: ['При наявності додаткових гостей вартість їх проживання дорівнює 0!'],
};

export const errorValidationMessages = {
    max_adults: ['Мінімальна кількість гостей - 1!'],
    extra_children: [
        'При наявності додаткових гостей (дітей) їх кількість не може бути менше 2 або більше 4!',
    ],
};
