export const messages = [
    {
        id: 1,
        position: 'main',
        title: 'Поки онуки дідуся працюють над сайтом, бронювання можливе через форму. Дякую за розуміння!',
        subtitle: 'Відправити запит на дзвінок' ,
        message: 'Опишіть мету вашого звернення. \nНаприклад, потрібен номер на __ гостей, на __ період',
    },
    {
        id: 2,
        position: 'success',
        title: `Успішно `,
        subtitle: 'Запит відправлено',
        message: 'Найближчим часом з вами зв’яжеться помічник Дідуся для уточнення бронювання',
    },
    {
        id: 3,
        position: 'error',
        title: 'Щось пішло не так :(',
        subtitle: 'Запит НЕ відправлено',
        message: 'Повторіть спробу ще раз',
    }
]