export const rules = [
  {
    id: 1,
    title: "Заселення та Виселення",
    description:
      "<b>Заселення гостей</b> о 14:00 годині, а <b>виїзд</b> о 12:00 годині. Це час, коли Дідусь готується вітати нових друзів та проводжати вже близьких. Адже Дідусь створив це місце, щоб відпочити від сучасного світу та насолодитись моментом, що відбувається.",
  },
  {
    id: 2,
    title: "Мобільний зв’язок та інтернет",
    description:
      "На Садибі в Дідуся працюють оператори мобільного зв’язку <b>Lifecell та Vodafone та є вай-фай на території Трапезної.</b> Отже, улюблені гості зможуть завжди бути на зв’язку з рідними, за потреби.",
  },
  {
    id: 3,
    title: "Їжа, яку не треба готувати самому",
    description:
      "В затишних будиночках та хатинках у Дідуся не передбачена окрема кухня. Гості можуть <b>заздалегідь замовити смачну українську домашню їжу,</b> що приготують чарівні помічниці Дідуся. Або самостійно приготувати щось смачненьке, скориставшись мангалами на території.",
  },
  {
    id: 4,
    title: "Гриль-Вечірки",
    description:
      "Мангали на території еко-садиби <b>входять у вартість проживання.</b> Запалюй вогнище, готуй свої улюблені страви та насолоджуйся смаком, знаходячись  в обіймах зелені та цвіту, серед неймовірної природи і чистого лісового повітря. Атмосфера, що панує тут зробить їжу, ще смачнішою та подарує незабутні емоції.",
  },
  {
    id: 5,
    title: "Безпека майна та компенсація",
    description:
      "Дідусь завжди дуже гостинний. Якщо виникнуть непорозуміння, будь-яке питання має рішення та може бути компенсоване.Пам’ятай - тут, ти завжди <b>найращий та бажаний гість.</b> ",
  },
  {
    id: 6,
    title: "Дружність та взаємоповага",
    description:
      "Для підтримання загальної атмосфери спокою та гармонії <b>важливо поважати один одного та дотримуватись внутрішніх правил.</b> також важливою є ввічлива поведінка по відношенню до всіх людей, що знаходяться на території. Твій Френдлі Дідусь прагне створити добру та легку атмосферу абсолютно для всіх гостей та друзів цього надзвичайного місця, Садиба розквітає, коли відчуває <b>тепло та повагу,</b> що заповнюють собою все навколо.",
  },
  {
    id: 7,
    title: "Електронапруга та прилади",
    description:
      "Важливим є <b>правильне та обережне використання електроприладів, задля дотримання всіх необхідних норм</b> поводження з електрикою та підтримання безпечної атмосфери. Великі та енергозатратні прилади (наприклад, мультиварку) Дідусь дуже просить залишити вдома та не використовувати на території Садиби задля уникнення перевантаження мережі та дотримання комфортних умов для всіх гостей. На території є <b>електрочайник загального користування,</b> якщо гості бажають заварити каву, або чай самостійно чи підігріти воду для годування дитини.    ",
  },
  {
    id: 8,
    title: "Тиша в ночі та спокій",
    description:
      "Твій Дудусь поважного віку, отож о 23:00 відправляється спати. Задля спокою та повноцінного сну всіх гостей Садиби з 23:00 - <b>діють правила тиші</b> та спокійного відпочинку.",
  },
  {
    id: 9,
    title: "Бронювання",
    description:
      "Як тільки розпочався процес бронювання хатинки в еко-садибі “На селі у Дідуся” - ми з тобою стали справжніми друзями. Твій Дідусь і його помічники потурбуються про все, адже відтепер всі як одна родина - гості  Садиби повинні відчувати себе безтурботно і відпочивати.</br> В <b>Літній період</b> можна забронювати хатинку чи будиночок починаючи від <b>2 діб</b>, а в <b>Зимовий період</b> - від <b>1 доби.</b>",
  },
  {
    id: 10,
    title: "Оплата",
    description:
      "Дідусь завжди йде на зустріч своїм гостям, тому одразу потрібно <b>оплатити вартість хатинки лише за першу добу,</b> а по приїзду доплатити решту, за умови, що бронювання було здійснене більше ніж на 1 добу.</br> Плата нараховується за кожну добу на Садибі, незалежно від часу приїзду.",
  },
  {
    id: 11,
    title: "Гнучкість та скасування",
    description:
      "Дідусь <b>поверне кошти,</b> якщо твій відпочинок запланований <b>через тиждень, або більше.</b> Адже Садиба завжди має багато бажаючих насолодитись часом тут та отримати незабутні емоції.",
  },
];
