export const meals = [
  {
    id: 1,
    title: "Мангали",
    description:
      "Мангали на території *[еко-садиби “На селі у Дідуся”](/)* **входять у вартість проживання.** Запалюй вогнище, готуй свої улюблені *страви в еко-стилі* та насолоджуйся смаком, знаходячись  в обіймах зелені та цвіту, серед неймовірної природи і чистого лісового повітря.\n\n Атмосфера, що панує тут зробить їжу, ще смачнішою та подарує незабутні емоції.",
    photo: [
      "/images/meals/grill.png",
      "/images/meals/grill-s.png",
      "/images/meals/grill-m.png",
    ],
  },
  {
    id: 2,
    title: "Літня кухня",
    description:
      "Влітку всі гості Садиби мають можливість використувати **Літню кухню** для приготуванння улюблених страв. Готувати на природі, серед зелені, свіжого повітря та атмосфери українського села - **неймовірна насолода.** Приготована на природі *їжа в еко-стилі* - автоматично стає максимально смачною та залишає приємні спогади.\n\n Використання кухні має символічну вартість -\n 150&nbsp;грн./доба, задля можливості комфортно та вільно почувати себе в просторі для приготування їжі.",
    photo: [
      "/images/meals/kitchen.png",
      "/images/meals/kitchen-veg.png",
      "/images/meals/kitchen-pot.png",
    ],
  },
  {
    id: 3,
    title: "їжа, яку не треба готувати самому ",
    description:
      "Дідусь завжди максимально піклується про тебе, тому на Садибі є можливість заздалегідь замовити **домашні українські страви**, щоб відчути справжній смак місцевої культури, спробувати національну кухню та **максимально насолодитись відпочинком** без самостійного приготування їжі.",
    photo: [
      "/images/meals/self-cooking.png",
      "/images/meals/self-cooking-borsch.png",
      "/images/meals/self-cooking-pelmeni.png",
    ],
  },
];
